## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.global-network.google_compute_network.this will be created
  + resource "google_compute_network" "this" {
      + auto_create_subnetworks                   = true
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = 1460
      + name                                      = "vpc-siguiente-global"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "siguiente-mexico"
      + routing_mode                              = "GLOBAL"
      + self_link                                 = (known after apply)
    }

  # module.zero-trust-firewall.cloudflare_zero_trust_list.cloudflare will be created
  + resource "cloudflare_zero_trust_list" "cloudflare" {
      + account_id = "02ee7b87eb8a52627a53b88821c9ae95"
      + created_at = (known after apply)
      + id         = (known after apply)
      + items      = [
          + {
              + created_at = (known after apply)
              + value      = "cloudflare.com"
            },
          + {
              + created_at = (known after apply)
              + value      = "dash.cloudflare.com"
            },
          + {
              + created_at = (known after apply)
              + value      = "one.dash.cloudflare.com"
            },
          + {
              + created_at = (known after apply)
              + value      = "cloudflare-dns.com"
            },
          + {
              + created_at = (known after apply)
              + value      = "engage.cloudflareclient.com"
            },
          + {
              + created_at = (known after apply)
              + value      = "zero-trust-client.cloudflareclient.com"
            },
          + {
              + created_at = (known after apply)
              + value      = "connectivity.cloudflareclient.com"
            },
          + {
              + created_at = (known after apply)
              + value      = "time.cloudflare.com"
            },
          + {
              + created_at = (known after apply)
              + value      = "ryanjeremypridgen.cloudflareaccess.com"
            },
          + {
              + created_at = (known after apply)
              + value      = "ryanjeremypridgen.cloudflare-gateway.com"
            },
        ]
      + list_count = (known after apply)
      + name       = "Cloudflare Hostnames"
      + type       = "DOMAIN"
      + updated_at = (known after apply)
    }

  # module.zero-trust-firewall.cloudflare_zero_trust_list.cloudflare_ip will be created
  + resource "cloudflare_zero_trust_list" "cloudflare_ip" {
      + account_id = "02ee7b87eb8a52627a53b88821c9ae95"
      + created_at = (known after apply)
      + id         = (known after apply)
      + items      = [
          + {
              + created_at = (known after apply)
              + value      = "162.159.137.105"
            },
          + {
              + created_at = (known after apply)
              + value      = "162.159.138.105"
            },
          + {
              + created_at = (known after apply)
              + value      = "2606:4700:7::a29f:8969"
            },
          + {
              + created_at = (known after apply)
              + value      = "2606:4700:7::a29f:8a69"
            },
          + {
              + created_at = (known after apply)
              + value      = "162.159.36.1"
            },
          + {
              + created_at = (known after apply)
              + value      = "162.159.46.1"
            },
          + {
              + created_at = (known after apply)
              + value      = "2606:4700:4700::1111"
            },
          + {
              + created_at = (known after apply)
              + value      = "2606:4700:4700::1001"
            },
          + {
              + created_at = (known after apply)
              + value      = "162.159.193.0/24"
            },
          + {
              + created_at = (known after apply)
              + value      = "2606:4700:100::/48"
            },
          + {
              + created_at = (known after apply)
              + value      = "162.159.197.0/24"
            },
          + {
              + created_at = (known after apply)
              + value      = "2606:4700:102::/48"
            },
          + {
              + created_at = (known after apply)
              + value      = "162.159.197.3"
            },
          + {
              + created_at = (known after apply)
              + value      = "2606:4700:102::3"
            },
          + {
              + created_at = (known after apply)
              + value      = "162.159.197.4"
            },
          + {
              + created_at = (known after apply)
              + value      = "2606:4700:102::4"
            },
        ]
      + list_count = (known after apply)
      + name       = "Cloudflare IP"
      + type       = "IP"
      + updated_at = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>